app/controllers/api/v1/users/lists/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = ? AND "items"."user_id" = '1'  [["list_id", 3]]
---
  def index
    @list = List.includes(:items).find_by!(user_id: params[:user_id], id: params[:list_id])

INSERT INTO "items" ("title", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["list_id", 3], ["created_at", "2016-01-13 18:29:47.498458"], ["updated_at", "2016-01-13 18:29:47.498458"]]
---
  def create
    @item = @list.items.build(item_params)
    if @item.save

UPDATE "items" SET "state" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["state", "hellosss"], ["updated_at", "2016-01-13 18:37:56.547412"], ["id", 3]]
---
  def update
    if @item.update(item_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
---
  def set_list
    @list = List.find_by!(user_id: params[:user_id], id: params[:list_id])

SELECT  "items".* FROM "items" WHERE "items"."list_id" = ? AND "items"."id" = ? LIMIT 1  [["list_id", 3], ["id", 3]]
---
  def set_item
    @item = @list.items.find(params[:id])