app/controllers/api/v1/users/lists_controller.rb

  def index
    respond_with List.all.where(user_id: params[:user_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [["user_id", 1]]

  def show
    respond_with List.find_by!(id: params[:id], user_id: params[:user_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? AND "lists"."user_id" = ? LIMIT 1  [["id", 5], ["user_id", 1]]

  def create
    list = current_user.lists.build(list_params)
    if list.save
---
INSERT INTO "lists" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "hello"], ["user_id", 1], ["created_at", "2016-01-13 17:54:46.877984"], ["updated_at", "2016-01-13 17:54:46.877984"]]

  def update
    list = current_user.lists.find(params[:id])
    if list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "lists" SET "description" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["description", "hellos"], ["updated_at", "2016-01-13 17:57:41.095444"], ["id", 1]]

  def destroy
    list = current_user.lists.find(params[:id])
    list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]