app/controllers/api/v1/sessions_controller.rb

  def create
    user = find_user
    return unathorized_access unless user
    if user.valid_password? @user_password
      user.generate_authentication_token!
      user.save
---
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2016-01-13 17:12:21.412743"], ["current_sign_in_at", "2016-01-13 17:14:29.351963"], ["sign_in_count", 3], ["updated_at", "2016-01-13 17:14:29.352608"], ["id", 1]]

  def destroy
    current_user.generate_authentication_token!
    current_user.save
---
UPDATE "users" SET "auth_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["auth_token", "g_NWskL5LYpvypkwCxBd"], ["updated_at", "2016-01-13 19:10:47.799321"], ["id", 2]]

  def find_user
    @user_password = json['password']
    user_email = json['email']
    user_email.present? && User.find_by(email: user_email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "example@marketplace.com"]]